using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Компилятор
{
    class Erorr
    {
        public static Dictionary<byte, string> codeerror = new Dictionary<byte, string>() //словарик :) 
        {

            [2] = "Неверный идентификатор",
            [5] = "Неверное :",
            [51] = "Ожидалось :=",
            [15] = "Неверный var",
            [6] = "Неверный символ",
            [203] = "Привышение константы",
            [215] = "Лишняя скобка ",
            [212] = "Ожидалось }",
            [211] = "Ожидалось {",
            [213] = "Ожидалась конструкция (* *)",
            [214] = "Ожидалась закрытая скобка",
            [216] = "Ожидалось //",
            [94] = "Данный тип не существует",
            [61] = "Ожидалась точка",
            [88] = "Данная переменна не объявлялась в var",
            [12] = "Ожидаллось ]",
            [101] = "Ожидался of",
            [14] = "Ожидалось ;",
            [74] = "Ожидалось ..",
            [11] = "Ожидаллось [",
            [113] = "Ожидался begin",
            [104] = "Ожидался end",
            [52] = "Ожидался then",
            [212]= "Ожидалось }" ,          
            [103]= "Ожидалось to в for" ,    
            [54]= "Ожидалось do" ,
            [ 214]= "Нельзя ставить ; перед else" 

        };
    }
}
